describe "練習問題7" do
  # カフェで注文をする「カフェラテをください」を表示する order メソッドを定義して呼び出してください
  describe "問1" do
    example
  end

  # 辺の長さが 3 の正方形の面積を計算して戻り値とする area メソッドを書いてください。
  describe "問2" do
    example
  end

  # サイコロを振って出た目を戻り値とする dice メソッドを書いてください。
  # 呼び出して戻り値を画面に表示してください。
  describe "問3" do
    example
  end

  # カフェで注文をする、「ooをください」を表示する order メソッドを定義して呼び出してください。
  # 引数で注文する商品をメソッド呼び出し時に渡せるようにしてください。
  # そして、「カフェラテをください」と「モカをください」を表示してください。
  describe "問4" do
    example
  end

  # 問3 で作った dice メソッドを変更します。
  # サイコロを振って 1 が出たら「もう１回」と表示し、
  # さらにサイコロをもう一度振り直すようにしてください。
  describe "問5" do
    example
  end

  # 品物の値段を返す price メソッドを作ります。キーワード引数で
  # itemを渡し、itemが "コーヒー"のときは 300を、"カフェラテ" の時は
  # 400を戻り値として返してください
  describe "問6" do
    example
  end

  # 問6 に加えて、キーワード引数で size を渡し、sizeによって値段を上乗せしてください。
  # sizeが "ショート" の時は +0円、"トール" のときは +50円、"ベンティ" の時は +100円としてください
  describe "問7" do
    example
  end

  # 問7 を変更し、sizeが渡されてない時のデフォルト値として "ショート" を設定してください
  describe "問8" do
    example
  end

  # 次のプログラムはエラーになります。エラーにならずに「コーヒーをください」と表示する
  # ようにプログラムを書き換えてください。
  # def order
  #   puts "#{drink}をください"
  # end

  # drink = "コーヒー"
  # order
  describe "問8" do
    example
  end
end
